# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,4, 8,7, 16,8]      # P3/8
  - [12,14, 25,13, 20,23] # P4/16
  - [40,21, 30,40, 69,51] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [1, 32, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [32, 64, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [64, 64, 1]],
   [-1, 1, Conv, [64, 128, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [128, 128, 2]],
   [-1, 1, Conv, [128, 256, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [256, 256, 3]],
   [-1, 1, Conv, [256, 512, 3,2]],  # 7-P5/32
   [-1, 3, C3, [512, 512, 1]],
   [-1, 1, SPPF, [512, 512, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, 256, 1, False]],  # 13

   [-1, 1, Conv, [256, 128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, 128, 1, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 128, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, 256, 1, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [256, 256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, 512, 1, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
